//Напишите программу которая на вход принимает число и выдает его квардрат (число умноженное само на себя)
Console.Write("Введитте число: ");
int  number = int.Parse(Console.ReadLine());
int sqr = number*number;
Console.WriteLine($"Квадрат числа {number} равен {sqr}"); 
